feat: revisão do MVP descrito nos documentos de proposta
